; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l25_p25_c25_g25_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(at crate7 depot)
	(at crate8 depot)
	(at crate9 depot)
	(at crate10 depot)
	(at crate11 depot)
	(at crate12 depot)
	(at crate13 depot)
	(at crate14 depot)
	(at crate15 depot)
	(at crate16 depot)
	(at crate17 depot)
	(at crate18 depot)
	(at crate19 depot)
	(at crate20 depot)
	(at crate21 depot)
	(at crate22 depot)
	(at crate23 depot)
	(at crate24 depot)
	(at crate25 depot)
	(crate-content crate1 food)
	(crate-content crate2 food)
	(crate-content crate3 food)
	(crate-content crate4 food)
	(crate-content crate5 food)
	(crate-content crate6 food)
	(crate-content crate7 food)
	(crate-content crate8 food)
	(crate-content crate9 food)
	(crate-content crate10 food)
	(crate-content crate11 food)
	(crate-content crate12 food)
	(crate-content crate13 food)
	(crate-content crate14 food)
	(crate-content crate15 medicine)
	(crate-content crate16 medicine)
	(crate-content crate17 medicine)
	(crate-content crate18 medicine)
	(crate-content crate19 medicine)
	(crate-content crate20 medicine)
	(crate-content crate21 medicine)
	(crate-content crate22 medicine)
	(crate-content crate23 medicine)
	(crate-content crate24 medicine)
	(crate-content crate25 medicine)
	(at person1 loc18)
	(at person2 loc15)
	(at person3 loc17)
	(at person4 loc22)
	(at person5 loc18)
	(at person6 loc3)
	(at person7 loc8)
	(at person8 loc13)
	(at person9 loc4)
	(at person10 loc17)
	(at person11 loc18)
	(at person12 loc10)
	(at person13 loc5)
	(at person14 loc1)
	(at person15 loc25)
	(at person16 loc15)
	(at person17 loc24)
	(at person18 loc19)
	(at person19 loc17)
	(at person20 loc6)
	(at person21 loc23)
	(at person22 loc24)
	(at person23 loc8)
	(at person24 loc8)
	(at person25 loc11)
	(person-needs person1 food)
	(person-needs person2 medicine)
	(person-needs person3 food)
	(person-needs person5 food)
	(person-needs person6 food)
	(person-needs person7 medicine)
	(person-needs person8 food)
	(person-needs person9 food)
	(person-needs person10 medicine)
	(person-needs person11 medicine)
	(person-needs person14 food)
	(person-needs person14 medicine)
	(person-needs person15 food)
	(person-needs person15 medicine)
	(person-needs person16 food)
	(person-needs person17 medicine)
	(person-needs person18 medicine)
	(person-needs person19 food)
	(person-needs person20 food)
	(person-needs person20 medicine)
	(person-needs person21 food)
	(person-needs person22 medicine)
	(person-needs person23 food)
	(person-needs person24 food)
	(person-needs person24 medicine)
)
(:goal (and
	(at drone1 depot)
	(person-has person1 food)
	(person-has person2 medicine)
	(person-has person3 food)
	(person-has person5 food)
	(person-has person6 food)
	(person-has person7 medicine)
	(person-has person8 food)
	(person-has person9 food)
	(person-has person10 medicine)
	(person-has person11 medicine)
	(person-has person14 food)
	(person-has person14 medicine)
	(person-has person15 food)
	(person-has person15 medicine)
	(person-has person16 food)
	(person-has person17 medicine)
	(person-has person18 medicine)
	(person-has person19 food)
	(person-has person20 food)
	(person-has person20 medicine)
	(person-has person21 food)
	(person-has person22 medicine)
	(person-has person23 food)
	(person-has person24 food)
	(person-has person24 medicine)
	))
)

; plan
1. (grab-arm2 drone1 crate14 depot)
   deleted: (arm2-free drone1) (at crate14 depot)
   added: (arm2-load drone1 crate14)
   goals met: 1 of 26
2. (grab-arm1 drone1 crate25 depot)
   deleted: (arm1-free drone1) (at crate25 depot)
   added: (arm1-load drone1 crate25)
   goals met: 1 of 26
3. (move-drone drone1 depot loc3)
   deleted: (at drone1 depot)
   added: (at drone1 loc3)
   goals met: 0 of 26
4. (deliver-arm2 drone1 person6 crate14 food loc3)
   deleted: (arm2-load drone1 crate14) (person-needs person6 food)
   added: (arm2-free drone1) (person-has person6 food)
   goals met: 1 of 26
5. (move-drone drone1 loc3 loc19)
   deleted: (at drone1 loc3)
   added: (at drone1 loc19)
   goals met: 1 of 26
6. (move-drone drone1 loc19 depot)
   deleted: (at drone1 loc19)
   added: (at drone1 depot)
   goals met: 2 of 26
7. (grab-arm2 drone1 crate13 depot)
   deleted: (arm2-free drone1) (at crate13 depot)
   added: (arm2-load drone1 crate13)
   goals met: 2 of 26
8. (move-drone drone1 depot loc13)
   deleted: (at drone1 depot)
   added: (at drone1 loc13)
   goals met: 1 of 26
9. (deliver-arm2 drone1 person8 crate13 food loc13)
   deleted: (arm2-load drone1 crate13) (person-needs person8 food)
   added: (arm2-free drone1) (person-has person8 food)
   goals met: 2 of 26
10. (move-drone drone1 loc13 loc19)
   deleted: (at drone1 loc13)
   added: (at drone1 loc19)
   goals met: 2 of 26
11. (move-drone drone1 loc19 depot)
   deleted: (at drone1 loc19)
   added: (at drone1 depot)
   goals met: 3 of 26
12. (grab-arm2 drone1 crate12 depot)
   deleted: (arm2-free drone1) (at crate12 depot)
   added: (arm2-load drone1 crate12)
   goals met: 3 of 26
13. (move-drone drone1 depot loc4)
   deleted: (at drone1 depot)
   added: (at drone1 loc4)
   goals met: 2 of 26
14. (deliver-arm2 drone1 person9 crate12 food loc4)
   deleted: (arm2-load drone1 crate12) (person-needs person9 food)
   added: (arm2-free drone1) (person-has person9 food)
   goals met: 3 of 26
15. (move-drone drone1 loc4 loc19)
   deleted: (at drone1 loc4)
   added: (at drone1 loc19)
   goals met: 3 of 26
16. (move-drone drone1 loc19 depot)
   deleted: (at drone1 loc19)
   added: (at drone1 depot)
   goals met: 4 of 26
17. (grab-arm2 drone1 crate11 depot)
   deleted: (arm2-free drone1) (at crate11 depot)
   added: (arm2-load drone1 crate11)
   goals met: 4 of 26
18. (move-drone drone1 depot loc19)
   deleted: (at drone1 depot)
   added: (at drone1 loc19)
   goals met: 3 of 26
19. (deliver-arm1 drone1 person18 crate25 medicine loc19)
   deleted: (arm1-load drone1 crate25) (person-needs person18 medicine)
   added: (arm1-free drone1) (person-has person18 medicine)
   goals met: 4 of 26
20. (move-drone drone1 loc19 loc23)
   deleted: (at drone1 loc19)
   added: (at drone1 loc23)
   goals met: 4 of 26
21. (deliver-arm2 drone1 person21 crate11 food loc23)
   deleted: (arm2-load drone1 crate11) (person-needs person21 food)
   added: (arm2-free drone1) (person-has person21 food)
   goals met: 5 of 26
22. (move-drone drone1 loc23 loc18)
   deleted: (at drone1 loc23)
   added: (at drone1 loc18)
   goals met: 5 of 26
23. (move-drone drone1 loc18 depot)
   deleted: (at drone1 loc18)
   added: (at drone1 depot)
   goals met: 6 of 26
24. (grab-arm2 drone1 crate10 depot)
   deleted: (arm2-free drone1) (at crate10 depot)
   added: (arm2-load drone1 crate10)
   goals met: 6 of 26
25. (grab-arm1 drone1 crate24 depot)
   deleted: (arm1-free drone1) (at crate24 depot)
   added: (arm1-load drone1 crate24)
   goals met: 6 of 26
26. (move-drone drone1 depot loc18)
   deleted: (at drone1 depot)
   added: (at drone1 loc18)
   goals met: 5 of 26
27. (deliver-arm2 drone1 person1 crate10 food loc18)
   deleted: (arm2-load drone1 crate10) (person-needs person1 food)
   added: (arm2-free drone1) (person-has person1 food)
   goals met: 6 of 26
28. (move-drone drone1 loc18 depot)
   deleted: (at drone1 loc18)
   added: (at drone1 depot)
   goals met: 7 of 26
29. (grab-arm2 drone1 crate9 depot)
   deleted: (arm2-free drone1) (at crate9 depot)
   added: (arm2-load drone1 crate9)
   goals met: 7 of 26
30. (move-drone drone1 depot loc18)
   deleted: (at drone1 depot)
   added: (at drone1 loc18)
   goals met: 6 of 26
31. (deliver-arm2 drone1 person5 crate9 food loc18)
   deleted: (arm2-load drone1 crate9) (person-needs person5 food)
   added: (arm2-free drone1) (person-has person5 food)
   goals met: 7 of 26
32. (move-drone drone1 loc18 depot)
   deleted: (at drone1 loc18)
   added: (at drone1 depot)
   goals met: 8 of 26
33. (grab-arm2 drone1 crate8 depot)
   deleted: (arm2-free drone1) (at crate8 depot)
   added: (arm2-load drone1 crate8)
   goals met: 8 of 26
34. (move-drone drone1 depot loc18)
   deleted: (at drone1 depot)
   added: (at drone1 loc18)
   goals met: 7 of 26
35. (deliver-arm1 drone1 person11 crate24 medicine loc18)
   deleted: (arm1-load drone1 crate24) (person-needs person11 medicine)
   added: (arm1-free drone1) (person-has person11 medicine)
   goals met: 8 of 26
36. (move-drone drone1 loc18 loc15)
   deleted: (at drone1 loc18)
   added: (at drone1 loc15)
   goals met: 8 of 26
37. (move-drone drone1 loc15 depot)
   deleted: (at drone1 loc15)
   added: (at drone1 depot)
   goals met: 9 of 26
38. (grab-arm1 drone1 crate23 depot)
   deleted: (arm1-free drone1) (at crate23 depot)
   added: (arm1-load drone1 crate23)
   goals met: 9 of 26
39. (move-drone drone1 depot loc1)
   deleted: (at drone1 depot)
   added: (at drone1 loc1)
   goals met: 8 of 26
40. (deliver-arm2 drone1 person14 crate8 food loc1)
   deleted: (arm2-load drone1 crate8) (person-needs person14 food)
   added: (arm2-free drone1) (person-has person14 food)
   goals met: 9 of 26
41. (move-drone drone1 loc1 depot)
   deleted: (at drone1 loc1)
   added: (at drone1 depot)
   goals met: 10 of 26
42. (grab-arm2 drone1 crate7 depot)
   deleted: (arm2-free drone1) (at crate7 depot)
   added: (arm2-load drone1 crate7)
   goals met: 10 of 26
43. (move-drone drone1 depot loc1)
   deleted: (at drone1 depot)
   added: (at drone1 loc1)
   goals met: 9 of 26
44. (deliver-arm1 drone1 person14 crate23 medicine loc1)
   deleted: (arm1-load drone1 crate23) (person-needs person14 medicine)
   added: (arm1-free drone1) (person-has person14 medicine)
   goals met: 10 of 26
45. (move-drone drone1 loc1 loc15)
   deleted: (at drone1 loc1)
   added: (at drone1 loc15)
   goals met: 10 of 26
46. (move-drone drone1 loc15 depot)
   deleted: (at drone1 loc15)
   added: (at drone1 depot)
   goals met: 11 of 26
47. (grab-arm1 drone1 crate22 depot)
   deleted: (arm1-free drone1) (at crate22 depot)
   added: (arm1-load drone1 crate22)
   goals met: 11 of 26
48. (move-drone drone1 depot loc25)
   deleted: (at drone1 depot)
   added: (at drone1 loc25)
   goals met: 10 of 26
49. (deliver-arm2 drone1 person15 crate7 food loc25)
   deleted: (arm2-load drone1 crate7) (person-needs person15 food)
   added: (arm2-free drone1) (person-has person15 food)
   goals met: 11 of 26
50. (move-drone drone1 loc25 depot)
   deleted: (at drone1 loc25)
   added: (at drone1 depot)
   goals met: 12 of 26
51. (grab-arm2 drone1 crate6 depot)
   deleted: (arm2-free drone1) (at crate6 depot)
   added: (arm2-load drone1 crate6)
   goals met: 12 of 26
52. (move-drone drone1 depot loc25)
   deleted: (at drone1 depot)
   added: (at drone1 loc25)
   goals met: 11 of 26
53. (deliver-arm1 drone1 person15 crate22 medicine loc25)
   deleted: (arm1-load drone1 crate22) (person-needs person15 medicine)
   added: (arm1-free drone1) (person-has person15 medicine)
   goals met: 12 of 26
54. (move-drone drone1 loc25 loc15)
   deleted: (at drone1 loc25)
   added: (at drone1 loc15)
   goals met: 12 of 26
55. (move-drone drone1 loc15 depot)
   deleted: (at drone1 loc15)
   added: (at drone1 depot)
   goals met: 13 of 26
56. (grab-arm1 drone1 crate21 depot)
   deleted: (arm1-free drone1) (at crate21 depot)
   added: (arm1-load drone1 crate21)
   goals met: 13 of 26
57. (move-drone drone1 depot loc15)
   deleted: (at drone1 depot)
   added: (at drone1 loc15)
   goals met: 12 of 26
58. (deliver-arm1 drone1 person2 crate21 medicine loc15)
   deleted: (arm1-load drone1 crate21) (person-needs person2 medicine)
   added: (arm1-free drone1) (person-has person2 medicine)
   goals met: 13 of 26
59. (deliver-arm2 drone1 person16 crate6 food loc15)
   deleted: (arm2-load drone1 crate6) (person-needs person16 food)
   added: (arm2-free drone1) (person-has person16 food)
   goals met: 14 of 26
60. (move-drone drone1 loc15 loc17)
   deleted: (at drone1 loc15)
   added: (at drone1 loc17)
   goals met: 14 of 26
61. (move-drone drone1 loc17 depot)
   deleted: (at drone1 loc17)
   added: (at drone1 depot)
   goals met: 15 of 26
62. (grab-arm2 drone1 crate5 depot)
   deleted: (arm2-free drone1) (at crate5 depot)
   added: (arm2-load drone1 crate5)
   goals met: 15 of 26
63. (grab-arm1 drone1 crate20 depot)
   deleted: (arm1-free drone1) (at crate20 depot)
   added: (arm1-load drone1 crate20)
   goals met: 15 of 26
64. (move-drone drone1 depot loc17)
   deleted: (at drone1 depot)
   added: (at drone1 loc17)
   goals met: 14 of 26
65. (deliver-arm2 drone1 person3 crate5 food loc17)
   deleted: (arm2-load drone1 crate5) (person-needs person3 food)
   added: (arm2-free drone1) (person-has person3 food)
   goals met: 15 of 26
66. (move-drone drone1 loc17 depot)
   deleted: (at drone1 loc17)
   added: (at drone1 depot)
   goals met: 16 of 26
67. (grab-arm2 drone1 crate4 depot)
   deleted: (arm2-free drone1) (at crate4 depot)
   added: (arm2-load drone1 crate4)
   goals met: 16 of 26
68. (move-drone drone1 depot loc17)
   deleted: (at drone1 depot)
   added: (at drone1 loc17)
   goals met: 15 of 26
69. (deliver-arm1 drone1 person10 crate20 medicine loc17)
   deleted: (arm1-load drone1 crate20) (person-needs person10 medicine)
   added: (arm1-free drone1) (person-has person10 medicine)
   goals met: 16 of 26
70. (deliver-arm2 drone1 person19 crate4 food loc17)
   deleted: (arm2-load drone1 crate4) (person-needs person19 food)
   added: (arm2-free drone1) (person-has person19 food)
   goals met: 17 of 26
71. (move-drone drone1 loc17 loc6)
   deleted: (at drone1 loc17)
   added: (at drone1 loc6)
   goals met: 17 of 26
72. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 18 of 26
73. (grab-arm2 drone1 crate3 depot)
   deleted: (arm2-free drone1) (at crate3 depot)
   added: (arm2-load drone1 crate3)
   goals met: 18 of 26
74. (grab-arm1 drone1 crate19 depot)
   deleted: (arm1-free drone1) (at crate19 depot)
   added: (arm1-load drone1 crate19)
   goals met: 18 of 26
75. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 17 of 26
76. (deliver-arm2 drone1 person20 crate3 food loc6)
   deleted: (arm2-load drone1 crate3) (person-needs person20 food)
   added: (arm2-free drone1) (person-has person20 food)
   goals met: 18 of 26
77. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 19 of 26
78. (grab-arm2 drone1 crate2 depot)
   deleted: (arm2-free drone1) (at crate2 depot)
   added: (arm2-load drone1 crate2)
   goals met: 19 of 26
79. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 18 of 26
80. (deliver-arm1 drone1 person20 crate19 medicine loc6)
   deleted: (arm1-load drone1 crate19) (person-needs person20 medicine)
   added: (arm1-free drone1) (person-has person20 medicine)
   goals met: 19 of 26
81. (move-drone drone1 loc6 loc24)
   deleted: (at drone1 loc6)
   added: (at drone1 loc24)
   goals met: 19 of 26
82. (move-drone drone1 loc24 depot)
   deleted: (at drone1 loc24)
   added: (at drone1 depot)
   goals met: 20 of 26
83. (grab-arm1 drone1 crate18 depot)
   deleted: (arm1-free drone1) (at crate18 depot)
   added: (arm1-load drone1 crate18)
   goals met: 20 of 26
84. (move-drone drone1 depot loc24)
   deleted: (at drone1 depot)
   added: (at drone1 loc24)
   goals met: 19 of 26
85. (deliver-arm1 drone1 person17 crate18 medicine loc24)
   deleted: (arm1-load drone1 crate18) (person-needs person17 medicine)
   added: (arm1-free drone1) (person-has person17 medicine)
   goals met: 20 of 26
86. (move-drone drone1 loc24 depot)
   deleted: (at drone1 loc24)
   added: (at drone1 depot)
   goals met: 21 of 26
87. (grab-arm1 drone1 crate17 depot)
   deleted: (arm1-free drone1) (at crate17 depot)
   added: (arm1-load drone1 crate17)
   goals met: 21 of 26
88. (move-drone drone1 depot loc24)
   deleted: (at drone1 depot)
   added: (at drone1 loc24)
   goals met: 20 of 26
89. (deliver-arm1 drone1 person22 crate17 medicine loc24)
   deleted: (arm1-load drone1 crate17) (person-needs person22 medicine)
   added: (arm1-free drone1) (person-has person22 medicine)
   goals met: 21 of 26
90. (move-drone drone1 loc24 loc8)
   deleted: (at drone1 loc24)
   added: (at drone1 loc8)
   goals met: 21 of 26
91. (move-drone drone1 loc8 depot)
   deleted: (at drone1 loc8)
   added: (at drone1 depot)
   goals met: 22 of 26
92. (grab-arm1 drone1 crate16 depot)
   deleted: (arm1-free drone1) (at crate16 depot)
   added: (arm1-load drone1 crate16)
   goals met: 22 of 26
93. (move-drone drone1 depot loc8)
   deleted: (at drone1 depot)
   added: (at drone1 loc8)
   goals met: 21 of 26
94. (deliver-arm1 drone1 person7 crate16 medicine loc8)
   deleted: (arm1-load drone1 crate16) (person-needs person7 medicine)
   added: (arm1-free drone1) (person-has person7 medicine)
   goals met: 22 of 26
95. (move-drone drone1 loc8 depot)
   deleted: (at drone1 loc8)
   added: (at drone1 depot)
   goals met: 23 of 26
96. (grab-arm1 drone1 crate15 depot)
   deleted: (arm1-free drone1) (at crate15 depot)
   added: (arm1-load drone1 crate15)
   goals met: 23 of 26
97. (move-drone drone1 depot loc8)
   deleted: (at drone1 depot)
   added: (at drone1 loc8)
   goals met: 22 of 26
98. (deliver-arm1 drone1 person24 crate15 medicine loc8)
   deleted: (arm1-load drone1 crate15) (person-needs person24 medicine)
   added: (arm1-free drone1) (person-has person24 medicine)
   goals met: 23 of 26
99. (deliver-arm2 drone1 person23 crate2 food loc8)
   deleted: (arm2-load drone1 crate2) (person-needs person23 food)
   added: (arm2-free drone1) (person-has person23 food)
   goals met: 24 of 26
100. (move-drone drone1 loc8 depot)
   deleted: (at drone1 loc8)
   added: (at drone1 depot)
   goals met: 25 of 26
101. (grab-arm2 drone1 crate1 depot)
   deleted: (arm2-free drone1) (at crate1 depot)
   added: (arm2-load drone1 crate1)
   goals met: 25 of 26
102. (move-drone drone1 depot loc8)
   deleted: (at drone1 depot)
   added: (at drone1 loc8)
   goals met: 24 of 26
103. (deliver-arm2 drone1 person24 crate1 food loc8)
   deleted: (arm2-load drone1 crate1) (person-needs person24 food)
   added: (arm2-free drone1) (person-has person24 food)
   goals met: 25 of 26
104. (move-drone drone1 loc8 depot)
   deleted: (at drone1 loc8)
   added: (at drone1 depot)
   goals met: 26 of 26
